In [1]:
import pandas as pd

## 예제 2-18 데이터 프레임 팬시검색

In [36]:
import seaborn as sns

In [37]:
titanic = sns.load_dataset('titanic')

In [38]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [39]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [40]:
titanic[ ['age','sex','alive']] .head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [41]:
titanic[ ['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [42]:
titanic[ ['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [43]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

## 예제 2-19 시리즈 팬시검색

In [44]:
titanic_age = titanic['age']

In [45]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64